app/views/quotes/index.html.haml

SELECT "tags".* FROM "tags" INNER JOIN "quotes_tags" ON "tags"."id" = "quotes_tags"."tag_id" WHERE "quotes_tags"."quote_id" = 980190962
---
      .tags
        - quote.tags.each do |tag|