app/controllers/quotes_controller.rb

SELECT "quotes".* FROM "quotes" ORDER BY created_at DESC LIMIT 10
---
  def index
    @tag = nil
    if params[:tag].present?
      @tag = Tag.find(params[:tag])
      @quotes = @tag.quotes
    elsif params[:book].present?
      @quotes = Book.find(params[:book]).quotes
    else
      @quotes = Quote.limit(10).order('created_at DESC')

SELECT "quotes".* FROM "quotes" WHERE "quotes"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @quote = Quote.find(params[:id])

SELECT "quotes".* FROM "quotes" WHERE "quotes"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def edit
    @quote = Quote.find(params[:id])

INSERT INTO "quotes" ("book_id", "created_at", "text", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["book_id", nil], ["created_at", Mon, 26 Nov 2012 14:49:00 UTC +00:00], ["text", "mow lawn"], ["updated_at", Mon, 26 Nov 2012 14:49:00 UTC +00:00], ["user_id", 0]]
---
  def create
    @quote = Quote.new(params[:quote])
    @quote.user = current_user

    respond_to do |format|
      if @quote.save

SELECT "quotes".* FROM "quotes" WHERE "quotes"."id" = ? LIMIT 1  [["id", "980190962"]]
UPDATE "quotes" SET "text" = 'it works', "updated_at" = '2012-02-14 08:28:32.582038' WHERE "quotes"."id" = 980190962
---
  def update
    @quote = Quote.find(params[:id])

    respond_to do |format|
      if @quote.update_attributes(params[:quote])

SELECT "quotes".* FROM "quotes" WHERE "quotes"."id" = ? LIMIT 1  [["id", "980190962"]]
DELETE FROM "quotes" WHERE "quotes"."id" = ?  [["id", 980190962]]
---
  def destroy
    @quote = Quote.find(params[:id])
    @quote.destroy